In [2]:
# Combining and Merging Dataset
import pandas as pd
import numpy as np

In [10]:
data1=pd.DataFrame({
    'std_id':[1,2,3],
    'Name':['ali','ahmed','sara'],
    'age':[12,34,23]
    
})

In [11]:
data2=pd.DataFrame({
    'std_id':[4,5,6],
    'Name':['hira','anna','Tom'],
    'age':[45,12,56]
    
})

In [12]:
pd.concat([data1,data2])

   std_id   Name  age
0       1    ali   12
1       2  ahmed   34
2       3   sara   23
0       4   hira   45
1       5   anna   12
2       6    Tom   56

In [17]:
data3=pd.DataFrame({
    'id':[1,2,3],
    'salary':[34544,4354,34534]
    
})
data3

   id  salary
0   1   34544
1   2    4354
2   3   34534

In [20]:
pd.concat([data1,data3],axis=1)

   std_id   Name  age  id  salary
0       1    ali   12   1   34544
1       2  ahmed   34   2    4354
2       3   sara   23   3   34534

In [21]:
pd.concat([data1,data3],axis=0)

   std_id   Name   age   id   salary
0     1.0    ali  12.0  NaN      NaN
1     2.0  ahmed  34.0  NaN      NaN
2     3.0   sara  23.0  NaN      NaN
0     NaN    NaN   NaN  1.0  34544.0
1     NaN    NaN   NaN  2.0   4354.0
2     NaN    NaN   NaN  3.0  34534.0

In [45]:
#Merging Data
data4=pd.DataFrame({
    'id':[1,2,3],
    'Department':['SE','CS','IR']})

In [46]:
merge=pd.merge(data3,data4 ,on='id')
merge

   id  salary Department
0   1   34544         SE
1   2    4354         CS
2   3   34534         IR

In [49]:
data5=pd.DataFrame({
    'id':[4,5,6],
    'salary':[34544,4354,34534]
    
})

In [50]:
#Merging Data
data4=pd.DataFrame({
    'id':[4,5,6],
    'Department':['SE','CS','IR']})

In [51]:
merge=pd.merge(data5,data4 ,on='id')
merge

   id  salary Department
0   4   34544         SE
1   5    4354         CS
2   6   34534         IR

In [52]:
#Reshaping Data

In [59]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
  index=pd.Index(['Ohio', 'Colorado'], name='state'),
  columns=pd.Index(['one', 'two', 'three'],
  name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [4]:
import pandas as pd
data1=pd.DataFrame({
    'std_id':[1,2,3],
    'Name':['hira','jawad','sara'],
    'age':[12,34,23]
    
})
data1

   std_id   Name  age
0       1   hira   12
1       2  jawad   34
2       3   sara   23

In [6]:
pivot=data1.pivot(index='std_id',columns='Name',values='age')
pivot

Name    hira  jawad  sara
std_id
1       12.0    NaN   NaN
2        NaN   34.0   NaN
3        NaN    NaN  23.0

In [11]:
df_wide = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'],
                        'Math': [90, 80, 95],
                        'Science': [85, 75, 90],
                        'History': [95, 85, 80]})

# Reshape from wide to long format
df_long = pd.melt(df_wide, id_vars=['Name'], var_name='Subject', value_name='Score')

print(df_long)

      Name  Subject  Score
0    Alice     Math     90
1      Bob     Math     80
2  Charlie     Math     95
3    Alice  Science     85
4      Bob  Science     75
5  Charlie  Science     90
6    Alice  History     95
7      Bob  History     85
8  Charlie  History     80

In [12]:
df_wide = df_long.pivot(index='Name', columns='Subject', values='Score').reset_index()

print(df_wide)

Subject     Name  History  Math  Science
0          Alice       95    90       85
1            Bob       85    80       75
2        Charlie       80    95       90